{"id":"fake-store","name":"Fake Store API - FE App","rating":3.5,"category":["Software Engineering"],"description":"Fake Store API - FE App is a front-end application that uses mock data from the fake-store-api to simulate an e-commerce website. Developed as a personal project, it focuses on applying and deepening knowledge of Vue, Axios, and Vuex.","smImage":"/assets/project/fake-store.png","url":"https://saacostam.github.io/fake-store","iframe":{"isResponsive":true},"repoUrl":"https://github.com/saacostam/fake-store","content":[],"similarProjects":[{"id":"tune-code","name":"TuneCode: Musical Programming Language","rating":4.5,"description":"TuneCode is a web-based programming language tailored for music creation, designed for users familiar with Digital Audio Workstations (DAWs). By using familiar DAW-like concepts, TuneCode enables users to create and manipulate music directly through code. It allows the playback of melodies using basic oscillators, the scheduling of audio samples, and the application of effects to craft rich soundscapes. TuneCode bridges the gap between music production and coding, offering a new, flexible way to explore musical creativity.","category":["Music Software"],"smImage":"/assets/project/tune-code.png"},{"id":"chord-visualizer","name":"Chord Visualizer","rating":4.5,"description":"Chord Visualizer is a web app designed to help musicians and music enthusiasts learn chords through an interactive and engaging experience. The app features a real-time chord visualizer that syncs seamlessly with audio sources like YouTube videos, providing a dynamic way to follow along with music. Users can see chords displayed as they play, enhancing their learning experience by combining visual cues with auditory input. Whether you're practicing a song or learning new chords, Chord Visualizer makes the process intuitive and fun.","category":["Music Software"],"smImage":"/assets/project/chord-visualizer.png"},{"id":"trivia","name":"Trivia API - FE App","rating":3.5,"description":"This is a web application that utilizes the public trivia API to fetch trivia questions and track user performance. Built with React, Vite, and React Query, the app provides an interactive trivia experience, allowing users to test their knowledge while monitoring their progress and stats.","category":["Software Engineering"],"smImage":"/assets/project/trivia.png"}]}