{"id":"lalu","name":"Lalu: Spotify Clone - FE App","rating":4.2,"category":["Music Software","Software Engineering"],"description":"Lalu is a frontend application inspired by Spotify, designed to allow users to stream music, explore artist profiles, and enjoy curated playlists. Originally developed as a class project, the app was built to interface with a complex backend powered by distributed microservices using various programming languages and components. In its current state, the frontend relies on mock data to simulate the original functionality, providing an engaging music streaming experience without the need for a full backend infrastructure.","smImage":"/assets/project/lalu.png","url":"https://saacostam.github.io/lalu/","iframe":{"isResponsive":true},"repoUrl":"https://github.com/saacostam/lalu","content":[],"similarProjects":[{"id":"tune-code","name":"TuneCode: Musical Programming Language","rating":4.5,"description":"TuneCode is a web-based programming language tailored for music creation, designed for users familiar with Digital Audio Workstations (DAWs). By using familiar DAW-like concepts, TuneCode enables users to create and manipulate music directly through code. It allows the playback of melodies using basic oscillators, the scheduling of audio samples, and the application of effects to craft rich soundscapes. TuneCode bridges the gap between music production and coding, offering a new, flexible way to explore musical creativity.","category":["Music Software"],"smImage":"/assets/project/tune-code.png"},{"id":"chord-visualizer","name":"Chord Visualizer","rating":4.5,"description":"Chord Visualizer is a web app designed to help musicians and music enthusiasts learn chords through an interactive and engaging experience. The app features a real-time chord visualizer that syncs seamlessly with audio sources like YouTube videos, providing a dynamic way to follow along with music. Users can see chords displayed as they play, enhancing their learning experience by combining visual cues with auditory input. Whether you're practicing a song or learning new chords, Chord Visualizer makes the process intuitive and fun.","category":["Music Software"],"smImage":"/assets/project/chord-visualizer.png"},{"id":"3d-music-visualizer","name":"3D Music Visualizer","rating":4,"description":"3D Music Visualizer is a web application that generates attractive 3D visualizations of audio files, using the AnalyserNode from the JavaScript Audio API combined with p5.js and WEBGL for rendering. Users can upload their own audio tracks, customize various visual parameters, and select from different visualization modes to create a personalized experience. This project provides an engaging and dynamic way to explore the connection between sound and visuals.","category":["Music Software"],"smImage":"/assets/project/3d-music-visualizer.png"}]}