{"id":"slippery-slope","name":"Slippery Slope","rating":3.5,"category":["Games"],"description":"Slippery Slope is a platform game developed using the HTML Canvas element. The game's unique challenge comes from its slippery mechanics, a result of experimenting with friction physics during development. Players navigate through various levels, dealing with the game's intentionally slippery surfaces, which add a distinctive twist to the platforming experience.","smImage":"/assets/project/slippery-slope.png","url":"https://saacostam.github.io/slippery-slope/","iframe":{"isResponsive":true,"canBeUsedInMobile":false,"height":435,"width":830},"repoUrl":"https://github.com/saacostam/slippery-slope","content":[],"similarProjects":[{"id":"3d-tower-defense","name":"3D Tower Defense","rating":4.2,"description":"🛡️ A strategy game where players defend against waves of enemies by strategically placing towers on a dynamic 3D map. Built with a classic game loop architecture, the game uses Three.js for seamless 3D WebGL rendering. While still a work in progress, it showcases complex game logic, a variety of enemy types, and advanced rendering techniques. Future updates will introduce level-based gameplay for increasingly difficult challenges and resource management mechanics to add strategic depth.","category":["Games"],"smImage":"/assets/project/3d-tower-defense.png"},{"id":"crossy-road","name":"Crossy Road - Game Clone","rating":4.1,"description":"This is a 3D recreation of the popular game Crossy Road, developed using BabylonJs as the game engine. The project's architecture and class structure closely follow the ExcaliburJs framework, while leveraging BabylonJs's 3D primitives to bring the game world to life. This project showcases the implementation of core gameplay mechanics in a 3D environment, providing a modern twist on a familiar classic.","category":["Games"],"smImage":"/assets/project/crossy-road.png"},{"id":"bio-rastro","name":"BioRastro - Game","rating":4,"description":"BioRastro is a Pokémon-inspired game where players explore the Chingaza páramo, discovering its unique fauna. The game's goal is to educate players about the rich biodiversity of this Colombian ecosystem and Colombia 🇨🇴 as a whole. Built using Excalibur.js, BioRastro combines adventure and learning, offering an engaging way to raise awareness about environmental conservation.","category":["Games"],"smImage":"/assets/project/bio-rastro.png"}]}